--
-- База данных: `world`
--

-- --------------------------------------------------------

--
-- Структура таблицы `capitals`
--

CREATE TABLE `capitals` (
  `id` int(10) UNSIGNED NOT NULL,
  `geoname_id` int(11) DEFAULT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `population` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `weather_url` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `date_of_foundation` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `tel_code` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `local_time` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `description` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `countries`
--

CREATE TABLE `countries` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `fullname` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `english` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `alpha2` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `alpha3` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `iso` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `location` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `map_iframe` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `location_precise` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `countries`
--

INSERT INTO `countries` (`id`, `name`, `fullname`, `english`, `alpha2`, `alpha3`, `iso`, `location`, `map_iframe`, `location_precise`, `created_at`, `updated_at`) VALUES
(1, 'Абхазия', 'Республика Абхазия', 'Abkhazia', 'AB', 'ABH', '895', 'Азия', '', 'Закавказье', '2020-10-21 07:45:57', '2020-10-21 07:45:57'),
(2, 'Австралия', '', 'Australia', 'AU', 'AUS', '036', 'Океания', '', 'Австралия и Новая Зеландия', '2020-10-21 08:10:43', '2020-10-21 08:10:43'),
(3, 'Австрия', 'Австрийская Республика', 'Austria', 'AT', 'AUT', '040', 'Европа', '', 'Западная Европа', '2020-10-21 08:10:44', '2020-10-21 08:10:44'),
(4, 'Азербайджан', 'Республика Азербайджан', 'Azerbaijan', 'AZ', 'AZE', '031', 'Азия', '', 'Западная Азия', '2020-10-21 08:10:44', '2020-10-21 08:10:44'),
(5, 'Албания', 'Республика Албания', 'Albania', 'AL', 'ALB', '008', 'Европа', '', 'Южная Европа', '2020-10-21 08:10:44', '2020-10-21 08:10:44'),
(6, 'Алжир', 'Алжирская Народная Демократическая Республика', 'Algeria', 'DZ', 'DZA', '012', 'Африка', '', 'Северная Африка', '2020-10-21 08:10:44', '2020-10-21 08:10:44'),
(7, 'Американское Самоа', '', 'American Samoa', 'AS', 'ASM', '016', 'Океания', '', 'Полинезия', '2020-10-21 08:10:44', '2020-10-21 08:10:44'),
(8, 'Ангилья', '', 'Anguilla', 'AI', 'AIA', '660', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:10:44', '2020-10-21 08:10:44'),
(9, 'Ангола', 'Республика Ангола', 'Angola', 'AO', 'AGO', '024', 'Африка', '', 'Центральная Африка', '2020-10-21 08:10:45', '2020-10-21 08:10:45'),
(10, 'Андорра', 'Княжество Андорра', 'Andorra', 'AD', 'AND', '020', 'Европа', '', 'Южная Европа', '2020-10-21 08:10:45', '2020-10-21 08:10:45'),
(11, 'Антарктида', '', 'Antarctica', 'AQ', 'ATA', '010', 'Антарктика', '', '', '2020-10-21 08:14:27', '2020-10-21 08:14:27'),
(12, 'Антигуа и Барбуда', '', 'Antigua and Barbuda', 'AG', 'ATG', '028', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:27', '2020-10-21 08:14:27'),
(13, 'Аргентина', 'Аргентинская Республика', 'Argentina', 'AR', 'ARG', '032', 'Америка', '', 'Южная Америка', '2020-10-21 08:14:27', '2020-10-21 08:14:27'),
(14, 'Армения', 'Республика Армения', 'Armenia', 'AM', 'ARM', '051', 'Азия', '', 'Западная Азия', '2020-10-21 08:14:27', '2020-10-21 08:14:27'),
(15, 'Аруба', '', 'Aruba', 'AW', 'ABW', '533', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:27', '2020-10-21 08:14:27'),
(16, 'Афганистан', 'Переходное Исламское Государство Афганистан', 'Afghanistan', 'AF', 'AFG', '004', 'Азия', '', 'Южная часть Центральной Азии', '2020-10-21 08:14:27', '2020-10-21 08:14:27'),
(17, 'Багамы', 'Содружество Багамы', 'Bahamas', 'BS', 'BHS', '044', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:27', '2020-10-21 08:14:27'),
(18, 'Бангладеш', 'Народная Республика Бангладеш', 'Bangladesh', 'BD', 'BGD', '050', 'Азия', '', 'Южная часть Центральной Азии', '2020-10-21 08:14:27', '2020-10-21 08:14:27'),
(19, 'Барбадос', '', 'Barbados', 'BB', 'BRB', '052', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:27', '2020-10-21 08:14:27'),
(20, 'Бахрейн', 'Королевство Бахрейн', 'Bahrain', 'BH', 'BHR', '048', 'Азия', '', 'Западная Азия', '2020-10-21 08:14:27', '2020-10-21 08:14:27'),
(21, 'Беларусь', 'Республика Беларусь', 'Belarus', 'BY', 'BLR', '112', 'Европа', '', 'Восточная Европа', '2020-10-21 08:14:27', '2020-10-21 08:14:27'),
(22, 'Белиз', '', 'Belize', 'BZ', 'BLZ', '084', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:28', '2020-10-21 08:14:28'),
(23, 'Бельгия', 'Королевство Бельгии', 'Belgium', 'BE', 'BEL', '056', 'Европа', '', 'Западная Европа', '2020-10-21 08:14:28', '2020-10-21 08:14:28'),
(24, 'Бенин', 'Республика Бенин', 'Benin', 'BJ', 'BEN', '204', 'Африка', '', 'Западная Африка', '2020-10-21 08:14:28', '2020-10-21 08:14:28'),
(25, 'Бермуды', '', 'Bermuda', 'BM', 'BMU', '060', 'Америка', '', 'Северная Америка', '2020-10-21 08:14:28', '2020-10-21 08:14:28'),
(26, 'Болгария', 'Республика Болгария', 'Bulgaria', 'BG', 'BGR', '100', 'Европа', '', 'Восточная Европа', '2020-10-21 08:14:28', '2020-10-21 08:14:28'),
(27, 'Боливия, Многонациональное Государство', 'Многонациональное Государство Боливия', 'Bolivia, plurinational state of', 'BO', 'BOL', '068', 'Америка', '', 'Южная Америка', '2020-10-21 08:14:28', '2020-10-21 08:14:28'),
(28, 'Бонайре, Саба и Синт-Эстатиус', '', 'Bonaire, Sint Eustatius and Saba', 'BQ', 'BES', '535', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:28', '2020-10-21 08:14:28'),
(29, 'Босния и Герцеговина', '', 'Bosnia and Herzegovina', 'BA', 'BIH', '070', 'Европа', '', 'Южная Европа', '2020-10-21 08:14:28', '2020-10-21 08:14:28'),
(30, 'Ботсвана', 'Республика Ботсвана', 'Botswana', 'BW', 'BWA', '072', 'Африка', '', 'Южная часть Африки', '2020-10-21 08:14:28', '2020-10-21 08:14:28'),
(31, 'Бразилия', 'Федеративная Республика Бразилия', 'Brazil', 'BR', 'BRA', '076', 'Америка', '', 'Южная Америка', '2020-10-21 08:14:29', '2020-10-21 08:14:29'),
(32, 'Британская территория в Индийском океане', '', 'British Indian Ocean Territory', 'IO', 'IOT', '086', 'Океания', '', 'Индийский океан', '2020-10-21 08:14:29', '2020-10-21 08:14:29'),
(33, 'Бруней-Даруссалам', '', 'Brunei Darussalam', 'BN', 'BRN', '096', 'Азия', '', 'Юго-Восточная Азия', '2020-10-21 08:14:29', '2020-10-21 08:14:29'),
(34, 'Буркина-Фасо', '', 'Burkina Faso', 'BF', 'BFA', '854', 'Африка', '', 'Западная Африка', '2020-10-21 08:14:29', '2020-10-21 08:14:29'),
(35, 'Бурунди', 'Республика Бурунди', 'Burundi', 'BI', 'BDI', '108', 'Африка', '', 'Восточная Африка', '2020-10-21 08:14:29', '2020-10-21 08:14:29'),
(36, 'Бутан', 'Королевство Бутан', 'Bhutan', 'BT', 'BTN', '064', 'Азия', '', 'Южная часть Центральной Азии', '2020-10-21 08:14:29', '2020-10-21 08:14:29'),
(37, 'Вануату', 'Республика Вануату', 'Vanuatu', 'VU', 'VUT', '548', 'Океания', '', 'Меланезия', '2020-10-21 08:14:29', '2020-10-21 08:14:29'),
(38, 'Венгрия', 'Венгерская Республика', 'Hungary', 'HU', 'HUN', '348', 'Европа', '', 'Восточная Европа', '2020-10-21 08:14:29', '2020-10-21 08:14:29'),
(39, 'Венесуэла Боливарианская Республика', 'Боливарийская Республика Венесуэла', 'Venezuela', 'VE', 'VEN', '862', 'Америка', '', 'Южная Америка', '2020-10-21 08:14:29', '2020-10-21 08:14:29'),
(40, 'Виргинские острова, Британские', 'Британские Виргинские острова', 'Virgin Islands, British', 'VG', 'VGB', '092', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:29', '2020-10-21 08:14:29'),
(41, 'Виргинские острова, США', 'Виргинские острова Соединенных Штатов', 'Virgin Islands, U.S.', 'VI', 'VIR', '850', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:30', '2020-10-21 08:14:30'),
(42, 'Вьетнам', 'Социалистическая Республика Вьетнам', 'Vietnam', 'VN', 'VNM', '704', 'Азия', '', 'Юго-Восточная Азия', '2020-10-21 08:14:30', '2020-10-21 08:14:30'),
(43, 'Габон', 'Габонская Республика', 'Gabon', 'GA', 'GAB', '266', 'Африка', '', 'Центральная Африка', '2020-10-21 08:14:30', '2020-10-21 08:14:30'),
(44, 'Гаити', 'Республика Гаити', 'Haiti', 'HT', 'HTI', '332', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:30', '2020-10-21 08:14:30'),
(45, 'Гайана', 'Республика Гайана', 'Guyana', 'GY', 'GUY', '328', 'Америка', '', 'Южная Америка', '2020-10-21 08:14:30', '2020-10-21 08:14:30'),
(46, 'Гамбия', 'Республика Гамбия', 'Gambia', 'GM', 'GMB', '270', 'Африка', '', 'Западная Африка', '2020-10-21 08:14:30', '2020-10-21 08:14:30'),
(47, 'Гана', 'Республика Гана', 'Ghana', 'GH', 'GHA', '288', 'Африка', '', 'Западная Африка', '2020-10-21 08:14:30', '2020-10-21 08:14:30'),
(48, 'Гваделупа', '', 'Guadeloupe', 'GP', 'GLP', '312', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:30', '2020-10-21 08:14:30'),
(49, 'Гватемала', 'Республика Гватемала', 'Guatemala', 'GT', 'GTM', '320', 'Америка', '', 'Центральная Америка', '2020-10-21 08:14:30', '2020-10-21 08:14:30'),
(50, 'Гвинея', 'Гвинейская Республика', 'Guinea', 'GN', 'GIN', '324', 'Африка', '', 'Западная Африка', '2020-10-21 08:14:30', '2020-10-21 08:14:30'),
(51, 'Гвинея-Бисау', 'Республика Гвинея-Бисау', 'Guinea-Bissau', 'GW', 'GNB', '624', 'Африка', '', 'Западная Африка', '2020-10-21 08:14:30', '2020-10-21 08:14:30'),
(52, 'Германия', 'Федеративная Республика Германия', 'Germany', 'DE', 'DEU', '276', 'Европа', '', 'Западная Европа', '2020-10-21 08:14:30', '2020-10-21 08:14:30'),
(53, 'Гернси', '', 'Guernsey', 'GG', 'GGY', '831', 'Европа', '', 'Северная Европа', '2020-10-21 08:14:31', '2020-10-21 08:14:31'),
(54, 'Гибралтар', '', 'Gibraltar', 'GI', 'GIB', '292', 'Европа', '', 'Южная Европа', '2020-10-21 08:14:31', '2020-10-21 08:14:31'),
(55, 'Гондурас', 'Республика Гондурас', 'Honduras', 'HN', 'HND', '340', 'Америка', '', 'Центральная Америка', '2020-10-21 08:14:31', '2020-10-21 08:14:31'),
(56, 'Гонконг', 'Специальный  административный  регион Китая Гонконг', 'Hong Kong', 'HK', 'HKG', '344', 'Азия', '', 'Восточная Азия', '2020-10-21 08:14:31', '2020-10-21 08:14:31'),
(57, 'Гренада', '', 'Grenada', 'GD', 'GRD', '308', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:31', '2020-10-21 08:14:31'),
(58, 'Гренландия', '', 'Greenland', 'GL', 'GRL', '304', 'Америка', '', 'Северная Америка', '2020-10-21 08:14:31', '2020-10-21 08:14:31'),
(59, 'Греция', 'Греческая Республика', 'Greece', 'GR', 'GRC', '300', 'Европа', '', 'Южная Европа', '2020-10-21 08:14:31', '2020-10-21 08:14:31'),
(60, 'Грузия', '', 'Georgia', 'GE', 'GEO', '268', 'Азия', '', 'Западная Азия', '2020-10-21 08:14:31', '2020-10-21 08:14:31'),
(61, 'Гуам', '', 'Guam', 'GU', 'GUM', '316', 'Океания', '', 'Микронезия', '2020-10-21 08:14:31', '2020-10-21 08:14:31'),
(62, 'Дания', 'Королевство Дания', 'Denmark', 'DK', 'DNK', '208', 'Европа', '', 'Северная Европа', '2020-10-21 08:14:31', '2020-10-21 08:14:31'),
(63, 'Джерси', '', 'Jersey', 'JE', 'JEY', '832', 'Европа', '', 'Северная Европа', '2020-10-21 08:14:31', '2020-10-21 08:14:31'),
(64, 'Джибути', 'Республика Джибути', 'Djibouti', 'DJ', 'DJI', '262', 'Африка', '', 'Восточная Африка', '2020-10-21 08:14:32', '2020-10-21 08:14:32'),
(65, 'Доминика', 'Содружество Доминики', 'Dominica', 'DM', 'DMA', '212', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:32', '2020-10-21 08:14:32'),
(66, 'Доминиканская Республика', '', 'Dominican Republic', 'DO', 'DOM', '214', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:32', '2020-10-21 08:14:32'),
(67, 'Египет', 'Арабская Республика Египет', 'Egypt', 'EG', 'EGY', '818', 'Африка', '', 'Северная Африка', '2020-10-21 08:14:32', '2020-10-21 08:14:32'),
(68, 'Замбия', 'Республика Замбия', 'Zambia', 'ZM', 'ZMB', '894', 'Африка', '', 'Восточная Африка', '2020-10-21 08:14:32', '2020-10-21 08:14:32'),
(69, 'Западная Сахара', '', 'Western Sahara', 'EH', 'ESH', '732', 'Африка', '', 'Северная Африка', '2020-10-21 08:14:32', '2020-10-21 08:14:32'),
(70, 'Зимбабве', 'Республика Зимбабве', 'Zimbabwe', 'ZW', 'ZWE', '716', 'Африка', '', 'Восточная Африка', '2020-10-21 08:14:32', '2020-10-21 08:14:32'),
(71, 'Израиль', 'Государство Израиль', 'Israel', 'IL', 'ISR', '376', 'Азия', '', 'Западная Азия', '2020-10-21 08:14:32', '2020-10-21 08:14:32'),
(72, 'Индия', 'Республика Индия', 'India', 'IN', 'IND', '356', 'Азия', '', 'Южная часть Центральной Азии', '2020-10-21 08:14:33', '2020-10-21 08:14:33'),
(73, 'Индонезия', 'Республика Индонезия', 'Indonesia', 'ID', 'IDN', '360', 'Азия', '', 'Юго-Восточная Азия', '2020-10-21 08:14:33', '2020-10-21 08:14:33'),
(74, 'Иордания', 'Иорданское Хашимитское Королевство', 'Jordan', 'JO', 'JOR', '400', 'Азия', '', 'Западная Азия', '2020-10-21 08:14:33', '2020-10-21 08:14:33'),
(75, 'Ирак', 'Республика Ирак', 'Iraq', 'IQ', 'IRQ', '368', 'Азия', '', 'Западная Азия', '2020-10-21 08:14:33', '2020-10-21 08:14:33'),
(76, 'Иран, Исламская Республика', 'Исламская Республика Иран', 'Iran, Islamic Republic of', 'IR', 'IRN', '364', 'Азия', '', 'Южная часть Центральной Азии', '2020-10-21 08:14:33', '2020-10-21 08:14:33'),
(77, 'Ирландия', '', 'Ireland', 'IE', 'IRL', '372', 'Европа', '', 'Северная Европа', '2020-10-21 08:14:33', '2020-10-21 08:14:33'),
(78, 'Исландия', 'Республика Исландия', 'Iceland', 'IS', 'ISL', '352', 'Европа', '', 'Северная Европа', '2020-10-21 08:14:33', '2020-10-21 08:14:33'),
(79, 'Испания', 'Королевство Испания', 'Spain', 'ES', 'ESP', '724', 'Европа', '', 'Южная Европа', '2020-10-21 08:14:33', '2020-10-21 08:14:33'),
(80, 'Италия', 'Итальянская Республика', 'Italy', 'IT', 'ITA', '380', 'Европа', '', 'Южная Европа', '2020-10-21 08:14:33', '2020-10-21 08:14:33'),
(81, 'Йемен', 'Йеменская Республика', 'Yemen', 'YE', 'YEM', '887', 'Азия', '', 'Западная Азия', '2020-10-21 08:14:34', '2020-10-21 08:14:34'),
(82, 'Кабо-Верде', 'Республика Кабо-Верде', 'Cape Verde', 'CV', 'CPV', '132', 'Африка', '', 'Западная Африка', '2020-10-21 08:14:34', '2020-10-21 08:14:34'),
(83, 'Казахстан', 'Республика Казахстан', 'Kazakhstan', 'KZ', 'KAZ', '398', 'Азия', '', 'Южная часть Центральной Азии', '2020-10-21 08:14:34', '2020-10-21 08:14:34'),
(84, 'Камбоджа', 'Королевство Камбоджа', 'Cambodia', 'KH', 'KHM', '116', 'Азия', '', 'Юго-Восточная Азия', '2020-10-21 08:14:34', '2020-10-21 08:14:34'),
(85, 'Камерун', 'Республика Камерун', 'Cameroon', 'CM', 'CMR', '120', 'Африка', '', 'Центральная Африка', '2020-10-21 08:14:34', '2020-10-21 08:14:34'),
(86, 'Канада', '', 'Canada', 'CA', 'CAN', '124', 'Америка', '', 'Северная Америка', '2020-10-21 08:14:34', '2020-10-21 08:14:34'),
(87, 'Катар', 'Государство Катар', 'Qatar', 'QA', 'QAT', '634', 'Азия', '', 'Западная Азия', '2020-10-21 08:14:34', '2020-10-21 08:14:34'),
(88, 'Кения', 'Республика Кения', 'Kenya', 'KE', 'KEN', '404', 'Африка', '', 'Восточная Африка', '2020-10-21 08:14:34', '2020-10-21 08:14:34'),
(89, 'Кипр', 'Республика Кипр', 'Cyprus', 'CY', 'CYP', '196', 'Азия', '', 'Западная Азия', '2020-10-21 08:14:34', '2020-10-21 08:14:34'),
(90, 'Киргизия', 'Киргизская Республика', 'Kyrgyzstan', 'KG', 'KGZ', '417', 'Азия', '', 'Южная часть Центральной Азии', '2020-10-21 08:14:34', '2020-10-21 08:14:34'),
(91, 'Кирибати', 'Республика Кирибати', 'Kiribati', 'KI', 'KIR', '296', 'Океания', '', 'Микронезия', '2020-10-21 08:14:35', '2020-10-21 08:14:35'),
(92, 'Китай', 'Китайская Народная Республика', 'China', 'CN', 'CHN', '156', 'Азия', '', 'Восточная Азия', '2020-10-21 08:14:35', '2020-10-21 08:14:35'),
(93, 'Кокосовые (Килинг) острова', '', 'Cocos (Keeling) Islands', 'CC', 'CCK', '166', 'Океания', '', 'Индийский океан', '2020-10-21 08:14:35', '2020-10-21 08:14:35'),
(94, 'Колумбия', 'Республика Колумбия', 'Colombia', 'CO', 'COL', '170', 'Америка', '', 'Южная Америка', '2020-10-21 08:14:35', '2020-10-21 08:14:35'),
(95, 'Коморы', 'Союз Коморы', 'Comoros', 'KM', 'COM', '174', 'Африка', '', 'Восточная Африка', '2020-10-21 08:14:35', '2020-10-21 08:14:35'),
(96, 'Конго', 'Республика Конго', 'Congo', 'CG', 'COG', '178', 'Африка', '', 'Центральная Африка', '2020-10-21 08:14:35', '2020-10-21 08:14:35'),
(97, 'Конго, Демократическая Республика', 'Демократическая Республика Конго', 'Congo, Democratic Republic of the', 'CD', 'COD', '180', 'Африка', '', 'Центральная Африка', '2020-10-21 08:14:35', '2020-10-21 08:14:35'),
(98, 'Корея, Народно-Демократическая Республика', 'Корейская Народно-Демократическая Республика', 'Korea, Democratic People\'s republic of', 'KP', 'PRK', '408', 'Азия', '', 'Восточная Азия', '2020-10-21 08:14:35', '2020-10-21 08:14:35'),
(99, 'Корея, Республика', 'Республика Корея', 'Korea, Republic of', 'KR', 'KOR', '410', 'Азия', '', 'Восточная Азия', '2020-10-21 08:14:35', '2020-10-21 08:14:35'),
(100, 'Коста-Рика', 'Республика Коста-Рика', 'Costa Rica', 'CR', 'CRI', '188', 'Америка', '', 'Центральная Америка', '2020-10-21 08:14:35', '2020-10-21 08:14:35'),
(101, 'Кот д\'Ивуар', 'Республика Кот д\'Ивуар', 'Cote d\'Ivoire', 'CI', 'CIV', '384', 'Африка', '', 'Западная Африка', '2020-10-21 08:14:35', '2020-10-21 08:14:35'),
(102, 'Куба', 'Республика Куба', 'Cuba', 'CU', 'CUB', '192', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:36', '2020-10-21 08:14:36'),
(103, 'Кувейт', 'Государство Кувейт', 'Kuwait', 'KW', 'KWT', '414', 'Азия', '', 'Западная Азия', '2020-10-21 08:14:36', '2020-10-21 08:14:36'),
(104, 'Кюрасао', '', 'Curaçao', 'CW', 'CUW', '531', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:36', '2020-10-21 08:14:36'),
(105, 'Лаос', 'Лаосская Народно-Демократическая Республика', 'Lao People\'s Democratic Republic', 'LA', 'LAO', '418', 'Азия', '', 'Юго-Восточная Азия', '2020-10-21 08:14:36', '2020-10-21 08:14:36'),
(106, 'Латвия', 'Латвийская Республика', 'Latvia', 'LV', 'LVA', '428', 'Европа', '', 'Северная Европа', '2020-10-21 08:14:36', '2020-10-21 08:14:36'),
(107, 'Лесото', 'Королевство Лесото', 'Lesotho', 'LS', 'LSO', '426', 'Африка', '', 'Южная часть Африки', '2020-10-21 08:14:36', '2020-10-21 08:14:36'),
(108, 'Ливан', 'Ливанская Республика', 'Lebanon', 'LB', 'LBN', '422', 'Азия', '', 'Западная Азия', '2020-10-21 08:14:36', '2020-10-21 08:14:36'),
(109, 'Ливийская Арабская Джамахирия', 'Социалистическая Народная Ливийская Арабская Джамахирия', 'Libyan Arab Jamahiriya', 'LY', 'LBY', '434', 'Африка', '', 'Северная Африка', '2020-10-21 08:14:36', '2020-10-21 08:14:36'),
(110, 'Либерия', 'Республика Либерия', 'Liberia', 'LR', 'LBR', '430', 'Африка', '', 'Западная Африка', '2020-10-21 08:14:36', '2020-10-21 08:14:36'),
(111, 'Лихтенштейн', 'Княжество Лихтенштейн', 'Liechtenstein', 'LI', 'LIE', '438', 'Европа', '', 'Западная Европа', '2020-10-21 08:14:36', '2020-10-21 08:14:36'),
(112, 'Литва', 'Литовская Республика', 'Lithuania', 'LT', 'LTU', '440', 'Европа', '', 'Северная Европа', '2020-10-21 08:14:37', '2020-10-21 08:14:37'),
(113, 'Люксембург', 'Великое Герцогство Люксембург', 'Luxembourg', 'LU', 'LUX', '442', 'Европа', '', 'Западная Европа', '2020-10-21 08:14:37', '2020-10-21 08:14:37'),
(114, 'Маврикий', 'Республика Маврикий', 'Mauritius', 'MU', 'MUS', '480', 'Африка', '', 'Восточная Африка', '2020-10-21 08:14:37', '2020-10-21 08:14:37'),
(115, 'Мавритания', 'Исламская Республика Мавритания', 'Mauritania', 'MR', 'MRT', '478', 'Африка', '', 'Западная Африка', '2020-10-21 08:14:37', '2020-10-21 08:14:37'),
(116, 'Мадагаскар', 'Республика Мадагаскар', 'Madagascar', 'MG', 'MDG', '450', 'Африка', '', 'Восточная Африка', '2020-10-21 08:14:37', '2020-10-21 08:14:37'),
(117, 'Майотта', '', 'Mayotte', 'YT', 'MYT', '175', 'Африка', '', 'Южная часть Африки', '2020-10-21 08:14:37', '2020-10-21 08:14:37'),
(118, 'Макао', 'Специальный административный регион Китая Макао', 'Macao', 'MO', 'MAC', '446', 'Азия', '', 'Восточная Азия', '2020-10-21 08:14:37', '2020-10-21 08:14:37'),
(119, 'Малави', 'Республика Малави', 'Malawi', 'MW', 'MWI', '454', 'Африка', '', 'Восточная Африка', '2020-10-21 08:14:37', '2020-10-21 08:14:37'),
(120, 'Малайзия', '', 'Malaysia', 'MY', 'MYS', '458', 'Азия', '', 'Юго-Восточная Азия', '2020-10-21 08:14:37', '2020-10-21 08:14:37'),
(121, 'Мали', 'Республика Мали', 'Mali', 'ML', 'MLI', '466', 'Африка', '', 'Западная Африка', '2020-10-21 08:14:37', '2020-10-21 08:14:37'),
(122, 'Малые Тихоокеанские отдаленные острова Соединенных Штатов', '', 'United States Minor Outlying Islands', 'UM', 'UMI', '581', 'Океания', '', 'Индийский океан', '2020-10-21 08:14:37', '2020-10-21 08:14:37'),
(123, 'Мальдивы', 'Мальдивская Республика', 'Maldives', 'MV', 'MDV', '462', 'Азия', '', 'Южная часть Центральной Азии', '2020-10-21 08:14:37', '2020-10-21 08:14:37'),
(124, 'Мальта', 'Республика Мальта', 'Malta', 'MT', 'MLT', '470', 'Европа', '', 'Южная Европа', '2020-10-21 08:14:37', '2020-10-21 08:14:37'),
(125, 'Марокко', 'Королевство Марокко', 'Morocco', 'MA', 'MAR', '504', 'Африка', '', 'Северная Африка', '2020-10-21 08:14:37', '2020-10-21 08:14:37'),
(126, 'Мартиника', '', 'Martinique', 'MQ', 'MTQ', '474', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:38', '2020-10-21 08:14:38'),
(127, 'Маршалловы острова', 'Республика Маршалловы острова', 'Marshall Islands', 'MH', 'MHL', '584', 'Океания', '', 'Микронезия', '2020-10-21 08:14:38', '2020-10-21 08:14:38'),
(128, 'Мексика', 'Мексиканские Соединенные Штаты', 'Mexico', 'MX', 'MEX', '484', 'Америка', '', 'Центральная Америка', '2020-10-21 08:14:38', '2020-10-21 08:14:38'),
(129, 'Микронезия, Федеративные Штаты', 'Федеративные штаты Микронезии', 'Micronesia, Federated States of', 'FM', 'FSM', '583', 'Океания', '', 'Микронезия', '2020-10-21 08:14:38', '2020-10-21 08:14:38'),
(130, 'Мозамбик', 'Республика Мозамбик', 'Mozambique', 'MZ', 'MOZ', '508', 'Африка', '', 'Восточная Африка', '2020-10-21 08:14:38', '2020-10-21 08:14:38'),
(131, 'Молдова, Республика', 'Республика Молдова', 'Moldova', 'MD', 'MDA', '498', 'Европа', '', 'Восточная Европа', '2020-10-21 08:14:38', '2020-10-21 08:14:38'),
(132, 'Монако', 'Княжество Монако', 'Monaco', 'MC', 'MCO', '492', 'Европа', '', 'Западная Европа', '2020-10-21 08:14:38', '2020-10-21 08:14:38'),
(133, 'Монголия', '', 'Mongolia', 'MN', 'MNG', '496', 'Азия', '', 'Восточная Азия', '2020-10-21 08:14:38', '2020-10-21 08:14:38'),
(134, 'Монтсеррат', '', 'Montserrat', 'MS', 'MSR', '500', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:38', '2020-10-21 08:14:38'),
(135, 'Мьянма', 'Союз Мьянма', 'Myanmar', 'MM', 'MMR', '104', 'Азия', '', 'Юго-Восточная Азия', '2020-10-21 08:14:38', '2020-10-21 08:14:38'),
(136, 'Намибия', 'Республика Намибия', 'Namibia', 'NA', 'NAM', '516', 'Африка', '', 'Южная часть Африки', '2020-10-21 08:14:39', '2020-10-21 08:14:39'),
(137, 'Науру', 'Республика Науру', 'Nauru', 'NR', 'NRU', '520', 'Океания', '', 'Микронезия', '2020-10-21 08:14:39', '2020-10-21 08:14:39'),
(138, 'Непал', 'Федеративная Демократическая Республика Непал', 'Nepal', 'NP', 'NPL', '524', 'Азия', '', 'Южная часть Центральной Азии', '2020-10-21 08:14:39', '2020-10-21 08:14:39'),
(139, 'Нигер', 'Республика Нигер', 'Niger', 'NE', 'NER', '562', 'Африка', '', 'Западная Африка', '2020-10-21 08:14:39', '2020-10-21 08:14:39'),
(140, 'Нигерия', 'Федеративная Республика Нигерия', 'Nigeria', 'NG', 'NGA', '566', 'Африка', '', 'Западная Африка', '2020-10-21 08:14:39', '2020-10-21 08:14:39'),
(141, 'Нидерланды', 'Королевство Нидерландов', 'Netherlands', 'NL', 'NLD', '528', 'Европа', '', 'Западная Европа', '2020-10-21 08:14:39', '2020-10-21 08:14:39'),
(142, 'Никарагуа', 'Республика Никарагуа', 'Nicaragua', 'NI', 'NIC', '558', 'Америка', '', 'Центральная Америка', '2020-10-21 08:14:39', '2020-10-21 08:14:39'),
(143, 'Ниуэ', 'Республика Ниуэ', 'Niue', 'NU', 'NIU', '570', 'Океания', '', 'Полинезия', '2020-10-21 08:14:39', '2020-10-21 08:14:39'),
(144, 'Новая Зеландия', '', 'New Zealand', 'NZ', 'NZL', '554', 'Океания', '', 'Австралия и Новая Зеландия', '2020-10-21 08:14:40', '2020-10-21 08:14:40'),
(145, 'Новая Каледония', '', 'New Caledonia', 'NC', 'NCL', '540', 'Океания', '', 'Меланезия', '2020-10-21 08:14:40', '2020-10-21 08:14:40'),
(146, 'Норвегия', 'Королевство Норвегия', 'Norway', 'NO', 'NOR', '578', 'Европа', '', 'Северная Европа', '2020-10-21 08:14:40', '2020-10-21 08:14:40'),
(147, 'Объединенные Арабские Эмираты', '', 'United Arab Emirates', 'AE', 'ARE', '784', 'Азия', '', 'Западная Азия', '2020-10-21 08:14:40', '2020-10-21 08:14:40'),
(148, 'Оман', 'Султанат Оман', 'Oman', 'OM', 'OMN', '512', 'Азия', '', 'Западная Азия', '2020-10-21 08:14:40', '2020-10-21 08:14:40'),
(149, 'Остров Буве', '', 'Bouvet Island', 'BV', 'BVT', '074', '', '', 'Южный океан', '2020-10-21 08:14:40', '2020-10-21 08:14:40'),
(150, 'Остров Мэн', '', 'Isle of Man', 'IM', 'IMN', '833', 'Европа', '', 'Северная Европа', '2020-10-21 08:14:40', '2020-10-21 08:14:40'),
(151, 'Остров Норфолк', '', 'Norfolk Island', 'NF', 'NFK', '574', 'Океания', '', 'Австралия и Новая Зеландия', '2020-10-21 08:14:40', '2020-10-21 08:14:40'),
(152, 'Остров Рождества', '', 'Christmas Island', 'CX', 'CXR', '162', 'Азия', '', 'Индийский океан', '2020-10-21 08:14:40', '2020-10-21 08:14:40'),
(153, 'Остров Херд и острова Макдональд', '', 'Heard Island and McDonald Islands', 'HM', 'HMD', '334', '', '', 'Индийский океан', '2020-10-21 08:14:41', '2020-10-21 08:14:41'),
(154, 'Острова Кайман', '', 'Cayman Islands', 'KY', 'CYM', '136', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:41', '2020-10-21 08:14:41'),
(155, 'Острова Кука', '', 'Cook Islands', 'CK', 'COK', '184', 'Океания', '', 'Полинезия', '2020-10-21 08:14:41', '2020-10-21 08:14:41'),
(156, 'Острова Теркс и Кайкос', '', 'Turks and Caicos Islands', 'TC', 'TCA', '796', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:41', '2020-10-21 08:14:41'),
(157, 'Пакистан', 'Исламская Республика Пакистан', 'Pakistan', 'PK', 'PAK', '586', 'Азия', '', 'Южная часть Центральной Азии', '2020-10-21 08:14:41', '2020-10-21 08:14:41'),
(158, 'Палау', 'Республика Палау', 'Palau', 'PW', 'PLW', '585', 'Океания', '', 'Микронезия', '2020-10-21 08:14:41', '2020-10-21 08:14:41'),
(159, 'Палестинская территория, оккупированная', 'Оккупированная Палестинская территория', 'Palestinian Territory, Occupied', 'PS', 'PSE', '275', 'Азия', '', 'Западная Азия', '2020-10-21 08:14:41', '2020-10-21 08:14:41'),
(160, 'Панама', 'Республика Панама', 'Panama', 'PA', 'PAN', '591', 'Америка', '', 'Центральная Америка', '2020-10-21 08:14:41', '2020-10-21 08:14:41'),
(161, 'Папский Престол (Государство — город Ватикан)', '', 'Holy See (Vatican City State)', 'VA', 'VAT', '336', 'Европа', '', 'Южная Европа', '2020-10-21 08:14:42', '2020-10-21 08:14:42'),
(162, 'Папуа-Новая Гвинея', '', 'Papua New Guinea', 'PG', 'PNG', '598', 'Океания', '', 'Меланезия', '2020-10-21 08:14:42', '2020-10-21 08:14:42'),
(163, 'Парагвай', 'Республика Парагвай', 'Paraguay', 'PY', 'PRY', '600', 'Америка', '', 'Южная Америка', '2020-10-21 08:14:42', '2020-10-21 08:14:42'),
(164, 'Перу', 'Республика Перу', 'Peru', 'PE', 'PER', '604', 'Америка', '', 'Южная Америка', '2020-10-21 08:14:42', '2020-10-21 08:14:42'),
(165, 'Питкерн', '', 'Pitcairn', 'PN', 'PCN', '612', 'Океания', '', 'Полинезия', '2020-10-21 08:14:42', '2020-10-21 08:14:42'),
(166, 'Польша', 'Республика Польша', 'Poland', 'PL', 'POL', '616', 'Европа', '', 'Восточная Европа', '2020-10-21 08:14:42', '2020-10-21 08:14:42'),
(167, 'Португалия', 'Португальская Республика', 'Portugal', 'PT', 'PRT', '620', 'Европа', '', 'Южная Европа', '2020-10-21 08:14:42', '2020-10-21 08:14:42'),
(168, 'Пуэрто-Рико', '', 'Puerto Rico', 'PR', 'PRI', '630', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:42', '2020-10-21 08:14:42'),
(169, 'Республика Македония', '', 'Macedonia, The Former Yugoslav Republic Of', 'MK', 'MKD', '807', 'Европа', '', 'Южная Европа', '2020-10-21 08:14:42', '2020-10-21 08:14:42'),
(170, 'Реюньон', '', 'Reunion', 'RE', 'REU', '638', 'Африка', '', 'Восточная Африка', '2020-10-21 08:14:42', '2020-10-21 08:14:42'),
(171, 'Россия', 'Российская Федерация', 'Russian Federation', 'RU', 'RUS', '643', 'Европа', '', 'Восточная Европа', '2020-10-21 08:14:42', '2020-10-21 08:14:42'),
(172, 'Руанда', 'Руандийская Республика', 'Rwanda', 'RW', 'RWA', '646', 'Африка', '', 'Восточная Африка', '2020-10-21 08:14:42', '2020-10-21 08:14:42'),
(173, 'Румыния', '', 'Romania', 'RO', 'ROU', '642', 'Европа', '', 'Восточная Европа', '2020-10-21 08:14:42', '2020-10-21 08:14:42'),
(174, 'Самоа', 'Независимое Государство Самоа', 'Samoa', 'WS', 'WSM', '882', 'Океания', '', 'Полинезия', '2020-10-21 08:14:43', '2020-10-21 08:14:43'),
(175, 'Сан-Марино', 'Республика Сан-Марино', 'San Marino', 'SM', 'SMR', '674', 'Европа', '', 'Южная Европа', '2020-10-21 08:14:43', '2020-10-21 08:14:43'),
(176, 'Сан-Томе и Принсипи', 'Демократическая Республика Сан-Томе и Принсипи', 'Sao Tome and Principe', 'ST', 'STP', '678', 'Африка', '', 'Центральная Африка', '2020-10-21 08:14:43', '2020-10-21 08:14:43'),
(177, 'Саудовская Аравия', 'Королевство Саудовская Аравия', 'Saudi Arabia', 'SA', 'SAU', '682', 'Азия', '', 'Западная Азия', '2020-10-21 08:14:43', '2020-10-21 08:14:43'),
(178, 'Свазиленд', 'Королевство Свазиленд', 'Swaziland', 'SZ', 'SWZ', '748', 'Африка', '', 'Южная часть Африки', '2020-10-21 08:14:43', '2020-10-21 08:14:43'),
(179, 'Святая Елена, Остров вознесения, Тристан-да-Кунья', '', 'Saint Helena, Ascension And Tristan Da Cunha', 'SH', 'SHN', '654', 'Африка', '', 'Западная Африка', '2020-10-21 08:14:43', '2020-10-21 08:14:43'),
(180, 'Северные Марианские острова', 'Содружество Северных Марианских островов', 'Northern Mariana Islands', 'MP', 'MNP', '580', 'Океания', '', 'Микронезия', '2020-10-21 08:14:43', '2020-10-21 08:14:43'),
(181, 'Сен-Бартельми', '', 'Saint Barthélemy', 'BL', 'BLM', '652', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:43', '2020-10-21 08:14:43'),
(182, 'Сен-Мартен', '', 'Saint Martin (French Part)', 'MF', 'MAF', '663', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:43', '2020-10-21 08:14:43'),
(183, 'Сенегал', 'Республика Сенегал', 'Senegal', 'SN', 'SEN', '686', 'Африка', '', 'Западная Африка', '2020-10-21 08:14:43', '2020-10-21 08:14:43'),
(184, 'Сент-Винсент и Гренадины', '', 'Saint Vincent and the Grenadines', 'VC', 'VCT', '670', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:43', '2020-10-21 08:14:43'),
(185, 'Сент-Люсия', '', 'Saint Lucia', 'LC', 'LCA', '662', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:43', '2020-10-21 08:14:43'),
(186, 'Сент-Китс и Невис', '', 'Saint Kitts and Nevis', 'KN', 'KNA', '659', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:43', '2020-10-21 08:14:43'),
(187, 'Сент-Пьер и Микелон', '', 'Saint Pierre and Miquelon', 'PM', 'SPM', '666', 'Америка', '', 'Северная Америка', '2020-10-21 08:14:44', '2020-10-21 08:14:44'),
(188, 'Сербия', 'Республика Сербия', 'Serbia', 'RS', 'SRB', '688', 'Европа', '', 'Южная Европа', '2020-10-21 08:14:44', '2020-10-21 08:14:44'),
(189, 'Сейшелы', 'Республика Сейшелы', 'Seychelles', 'SC', 'SYC', '690', 'Африка', '', 'Восточная Африка', '2020-10-21 08:14:44', '2020-10-21 08:14:44'),
(190, 'Сингапур', 'Республика Сингапур', 'Singapore', 'SG', 'SGP', '702', 'Азия', '', 'Юго-Восточная Азия', '2020-10-21 08:14:44', '2020-10-21 08:14:44'),
(191, 'Синт-Мартен', '', 'Sint Maarten', 'SX', 'SXM', '534', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:44', '2020-10-21 08:14:44'),
(192, 'Сирийская Арабская Республика', '', 'Syrian Arab Republic', 'SY', 'SYR', '760', 'Азия', '', 'Западная Азия', '2020-10-21 08:14:44', '2020-10-21 08:14:44'),
(193, 'Словакия', 'Словацкая Республика', 'Slovakia', 'SK', 'SVK', '703', 'Европа', '', 'Восточная Европа', '2020-10-21 08:14:44', '2020-10-21 08:14:44'),
(194, 'Словения', 'Республика Словения', 'Slovenia', 'SI', 'SVN', '705', 'Европа', '', 'Южная Европа', '2020-10-21 08:14:44', '2020-10-21 08:14:44'),
(195, 'Соединенное Королевство', 'Соединенное Королевство Великобритании и Северной Ирландии', 'United Kingdom', 'GB', 'GBR', '826', 'Европа', '', 'Северная Европа', '2020-10-21 08:14:44', '2020-10-21 08:14:44'),
(196, 'Соединенные Штаты', 'Соединенные Штаты Америки', 'United States', 'US', 'USA', '840', 'Америка', '', 'Северная Америка', '2020-10-21 08:14:44', '2020-10-21 08:14:44'),
(197, 'Соломоновы острова', '', 'Solomon Islands', 'SB', 'SLB', '090', 'Океания', '', 'Меланезия', '2020-10-21 08:14:44', '2020-10-21 08:14:44'),
(198, 'Сомали', 'Сомалийская Республика', 'Somalia', 'SO', 'SOM', '706', 'Африка', '', 'Восточная Африка', '2020-10-21 08:14:45', '2020-10-21 08:14:45'),
(199, 'Судан', 'Республика Судан', 'Sudan', 'SD', 'SDN', '729', 'Африка', '', 'Северная Африка', '2020-10-21 08:14:45', '2020-10-21 08:14:45'),
(200, 'Суринам', 'Республика Суринам', 'Suriname', 'SR', 'SUR', '740', 'Америка', '', 'Южная Америка', '2020-10-21 08:14:45', '2020-10-21 08:14:45'),
(201, 'Сьерра-Леоне', 'Республика Сьерра-Леоне', 'Sierra Leone', 'SL', 'SLE', '694', 'Африка', '', 'Западная Африка', '2020-10-21 08:14:45', '2020-10-21 08:14:45'),
(202, 'Таджикистан', 'Республика Таджикистан', 'Tajikistan', 'TJ', 'TJK', '762', 'Азия', '', 'Южная часть Центральной Азии', '2020-10-21 08:14:45', '2020-10-21 08:14:45'),
(203, 'Таиланд', 'Королевство Таиланд', 'Thailand', 'TH', 'THA', '764', 'Азия', '', 'Юго-Восточная Азия', '2020-10-21 08:14:45', '2020-10-21 08:14:45'),
(204, 'Тайвань (Китай)', '', 'Taiwan, Province of China', 'TW', 'TWN', '158', 'Азия', '', 'Восточная Азия', '2020-10-21 08:14:45', '2020-10-21 08:14:45'),
(205, 'Танзания, Объединенная Республика', 'Объединенная Республика Танзания', 'Tanzania, United Republic Of', 'TZ', 'TZA', '834', 'Африка', '', 'Восточная Африка', '2020-10-21 08:14:45', '2020-10-21 08:14:45'),
(206, 'Тимор-Лесте', 'Демократическая Республика Тимор-Лесте', 'Timor-Leste', 'TL', 'TLS', '626', 'Азия', '', 'Юго-Восточная Азия', '2020-10-21 08:14:45', '2020-10-21 08:14:45'),
(207, 'Того', 'Тоголезская Республика', 'Togo', 'TG', 'TGO', '768', 'Африка', '', 'Западная Африка', '2020-10-21 08:14:45', '2020-10-21 08:14:45'),
(208, 'Токелау', '', 'Tokelau', 'TK', 'TKL', '772', 'Океания', '', 'Полинезия', '2020-10-21 08:14:46', '2020-10-21 08:14:46'),
(209, 'Тонга', 'Королевство Тонга', 'Tonga', 'TO', 'TON', '776', 'Океания', '', 'Полинезия', '2020-10-21 08:14:46', '2020-10-21 08:14:46'),
(210, 'Тринидад и Тобаго', 'Республика Тринидад и Тобаго', 'Trinidad and Tobago', 'TT', 'TTO', '780', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:46', '2020-10-21 08:14:46'),
(211, 'Тувалу', '', 'Tuvalu', 'TV', 'TUV', '798', 'Океания', '', 'Полинезия', '2020-10-21 08:14:46', '2020-10-21 08:14:46'),
(212, 'Тунис', 'Тунисская Республика', 'Tunisia', 'TN', 'TUN', '788', 'Африка', '', 'Северная Африка', '2020-10-21 08:14:46', '2020-10-21 08:14:46'),
(213, 'Туркмения', 'Туркменистан', 'Turkmenistan', 'TM', 'TKM', '795', 'Азия', '', 'Южная часть Центральной Азии', '2020-10-21 08:14:46', '2020-10-21 08:14:46'),
(214, 'Турция', 'Турецкая Республика', 'Turkey', 'TR', 'TUR', '792', 'Азия', '', 'Западная Азия', '2020-10-21 08:14:46', '2020-10-21 08:14:46'),
(215, 'Уганда', 'Республика Уганда', 'Uganda', 'UG', 'UGA', '800', 'Африка', '', 'Восточная Африка', '2020-10-21 08:14:46', '2020-10-21 08:14:46'),
(216, 'Узбекистан', 'Республика Узбекистан', 'Uzbekistan', 'UZ', 'UZB', '860', 'Азия', '', 'Южная часть Центральной Азии', '2020-10-21 08:14:46', '2020-10-21 08:14:46'),
(217, 'Украина', '', 'Ukraine', 'UA', 'UKR', '804', 'Европа', '', 'Восточная Европа', '2020-10-21 08:14:46', '2020-10-21 08:14:46'),
(218, 'Уоллис и Футуна', '', 'Wallis and Futuna', 'WF', 'WLF', '876', 'Океания', '', 'Полинезия', '2020-10-21 08:14:47', '2020-10-21 08:14:47'),
(219, 'Уругвай', 'Восточная Республика Уругвай', 'Uruguay', 'UY', 'URY', '858', 'Америка', '', 'Южная Америка', '2020-10-21 08:14:47', '2020-10-21 08:14:47'),
(220, 'Фарерские острова', '', 'Faroe Islands', 'FO', 'FRO', '234', 'Европа', '', 'Северная Европа', '2020-10-21 08:14:47', '2020-10-21 08:14:47'),
(221, 'Фиджи', 'Республика островов Фиджи', 'Fiji', 'FJ', 'FJI', '242', 'Океания', '', 'Меланезия', '2020-10-21 08:14:47', '2020-10-21 08:14:47'),
(222, 'Филиппины', 'Республика Филиппины', 'Philippines', 'PH', 'PHL', '608', 'Азия', '', 'Юго-Восточная Азия', '2020-10-21 08:14:47', '2020-10-21 08:14:47'),
(223, 'Финляндия', 'Финляндская Республика', 'Finland', 'FI', 'FIN', '246', 'Европа', '', 'Северная Европа', '2020-10-21 08:14:47', '2020-10-21 08:14:47'),
(224, 'Фолклендские острова (Мальвинские)', '', 'Falkland Islands (Malvinas)', 'FK', 'FLK', '238', 'Америка', '', 'Южная Америка', '2020-10-21 08:14:47', '2020-10-21 08:14:47'),
(225, 'Франция', 'Французская Республика', 'France', 'FR', 'FRA', '250', 'Европа', '', 'Западная Европа', '2020-10-21 08:14:47', '2020-10-21 08:14:47'),
(226, 'Французская Гвиана', '', 'French Guiana', 'GF', 'GUF', '254', 'Америка', '', 'Южная Америка', '2020-10-21 08:14:48', '2020-10-21 08:14:48'),
(227, 'Французская Полинезия', '', 'French Polynesia', 'PF', 'PYF', '258', 'Океания', '', 'Полинезия', '2020-10-21 08:14:48', '2020-10-21 08:14:48'),
(228, 'Французские Южные территории', '', 'French Southern Territories', 'TF', 'ATF', '260', '', '', 'Индийский океан', '2020-10-21 08:14:48', '2020-10-21 08:14:48'),
(229, 'Хорватия', 'Республика Хорватия', 'Croatia', 'HR', 'HRV', '191', 'Европа', '', 'Южная Европа', '2020-10-21 08:14:48', '2020-10-21 08:14:48'),
(230, 'Центрально-Африканская Республика', '', 'Central African Republic', 'CF', 'CAF', '140', 'Африка', '', 'Центральная Африка', '2020-10-21 08:14:48', '2020-10-21 08:14:48'),
(231, 'Чад', 'Республика Чад', 'Chad', 'TD', 'TCD', '148', 'Африка', '', 'Центральная Африка', '2020-10-21 08:14:48', '2020-10-21 08:14:48'),
(232, 'Черногория', 'Республика Черногория', 'Montenegro', 'ME', 'MNE', '499', 'Европа', '', 'Южная Европа', '2020-10-21 08:14:48', '2020-10-21 08:14:48'),
(233, 'Чешская Республика', '', 'Czech Republic', 'CZ', 'CZE', '203', 'Европа', '', 'Восточная Европа', '2020-10-21 08:14:48', '2020-10-21 08:14:48'),
(234, 'Чили', 'Республика Чили', 'Chile', 'CL', 'CHL', '152', 'Америка', '', 'Южная Америка', '2020-10-21 08:14:49', '2020-10-21 08:14:49'),
(235, 'Швейцария', 'Швейцарская Конфедерация', 'Switzerland', 'CH', 'CHE', '756', 'Европа', '', 'Западная Европа', '2020-10-21 08:14:49', '2020-10-21 08:14:49'),
(236, 'Швеция', 'Королевство Швеция', 'Sweden', 'SE', 'SWE', '752', 'Европа', '', 'Северная Европа', '2020-10-21 08:14:49', '2020-10-21 08:14:49'),
(237, 'Шпицберген и Ян Майен', '', 'Svalbard and Jan Mayen', 'SJ', 'SJM', '744', 'Европа', '', 'Северная Европа', '2020-10-21 08:14:49', '2020-10-21 08:14:49'),
(238, 'Шри-Ланка', 'Демократическая Социалистическая Республика Шри-Ланка', 'Sri Lanka', 'LK', 'LKA', '144', 'Азия', '', 'Южная часть Центральной Азии', '2020-10-21 08:14:49', '2020-10-21 08:14:49'),
(239, 'Эквадор', 'Республика Эквадор', 'Ecuador', 'EC', 'ECU', '218', 'Америка', '', 'Южная Америка', '2020-10-21 08:14:49', '2020-10-21 08:14:49'),
(240, 'Экваториальная Гвинея', 'Республика Экваториальная Гвинея', 'Equatorial Guinea', 'GQ', 'GNQ', '226', 'Африка', '', 'Центральная Африка', '2020-10-21 08:14:49', '2020-10-21 08:14:49'),
(241, 'Эландские острова', '', 'Åland Islands', 'AX', 'ALA', '248', 'Европа', '', 'Северная Европа', '2020-10-21 08:14:49', '2020-10-21 08:14:49'),
(242, 'Эль-Сальвадор', 'Республика Эль-Сальвадор', 'El Salvador', 'SV', 'SLV', '222', 'Америка', '', 'Центральная Америка', '2020-10-21 08:14:49', '2020-10-21 08:14:49'),
(243, 'Эритрея', '', 'Eritrea', 'ER', 'ERI', '232', 'Африка', '', 'Восточная Африка', '2020-10-21 08:14:50', '2020-10-21 08:14:50'),
(244, 'Эстония', 'Эстонская Республика', 'Estonia', 'EE', 'EST', '233', 'Европа', '', 'Северная Европа', '2020-10-21 08:14:50', '2020-10-21 08:14:50'),
(245, 'Эфиопия', 'Федеративная Демократическая Республика Эфиопия', 'Ethiopia', 'ET', 'ETH', '231', 'Африка', '', 'Восточная Африка', '2020-10-21 08:14:50', '2020-10-21 08:14:50'),
(246, 'Южная Африка', 'Южно-Африканская Республика', 'South Africa', 'ZA', 'ZAF', '710', 'Африка', '', 'Южная часть Африки', '2020-10-21 08:14:50', '2020-10-21 08:14:50'),
(247, 'Южная Джорджия и Южные Сандвичевы острова', '', 'South Georgia and the South Sandwich Islands', 'GS', 'SGS', '239', '', '', 'Южный океан', '2020-10-21 08:14:50', '2020-10-21 08:14:50'),
(248, 'Южная Осетия', 'Республика Южная Осетия', 'South Ossetia', 'OS', 'OST', '896', 'Азия', '', 'Закавказье', '2020-10-21 08:14:50', '2020-10-21 08:14:50'),
(249, 'Южный Судан', '', 'South Sudan', 'SS', 'SSD', '728', 'Африка', '', 'Северная Африка', '2020-10-21 08:14:50', '2020-10-21 08:14:50'),
(250, 'Ямайка', '', 'Jamaica', 'JM', 'JAM', '388', 'Америка', '', 'Карибский бассейн', '2020-10-21 08:14:50', '2020-10-21 08:14:50'),
(251, 'Япония', '', 'Japan', 'JP', 'JPN', '392', 'Азия', '', 'Восточная Азия', '2020-10-21 08:14:50', '2020-10-21 08:14:50');

-- --------------------------------------------------------

--
-- Структура таблицы `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `uuid` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `connection` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `queue` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `exception` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `google_news`
--

CREATE TABLE `google_news` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `body` longtext COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `country` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `alpha3` tinytext COLLATE utf8mb4_unicode_ci NOT NULL,
  `url` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `picture` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `putdate` tinytext COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `google_news`
--


--
-- Структура таблицы `links`
--

CREATE TABLE `links` (
  `id` int(10) UNSIGNED NOT NULL,
  `country_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `type` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `url` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `ico` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `links`
--

INSERT INTO `links` (`id`, `country_id`, `user_id`, `type`, `name`, `url`, `ico`, `created_at`, `updated_at`) VALUES
(1, 21, 1, NULL, 'Новости хартии', 'http://www.charter97.org', NULL, '2020-11-08 12:02:50', '2020-11-08 12:02:50');

-- --------------------------------------------------------

--
-- Структура таблицы `menus`
--

CREATE TABLE `menus` (
  `id` int(10) UNSIGNED NOT NULL,
  `position` int(11) DEFAULT NULL,
  `menu_type` int(11) NOT NULL DEFAULT 1,
  `icon` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `parent_id` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `menu_role`
--

CREATE TABLE `menu_role` (
  `menu_id` int(10) UNSIGNED NOT NULL,
  `role_id` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `messages`
--

CREATE TABLE `messages` (
  `id` int(10) UNSIGNED NOT NULL,
  `sender_id` int(11) DEFAULT NULL,
  `user_id` int(11) NOT NULL,
  `body` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `status` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `messages`
--

INSERT INTO `messages` (`id`, `sender_id`, `user_id`, `body`, `status`, `created_at`, `updated_at`) VALUES
(72, 1, 15, 'еуые', NULL, NULL, NULL),
(73, 15, 1, 'еуые', NULL, NULL, NULL),
(74, 1, 15, 'еуые', NULL, NULL, NULL),
(75, 1, 15, 'еdsfgуые', NULL, NULL, NULL),
(76, 1, 15, 'test', NULL, '2020-12-29 18:21:42', NULL),
(77, 15, 1, 'hj', NULL, NULL, NULL),
(78, 1, 15, 'jhgj', NULL, NULL, NULL),
(79, 1, 15, 'jhgj', NULL, NULL, NULL),
(80, 15, 1, 'jhbmngj', NULL, NULL, NULL),
(81, 1, 15, 'jh', NULL, '2020-12-18 18:27:34', NULL),
(82, 1, 15, 'test', NULL, NULL, NULL),
(83, 1, 15, 'test', NULL, NULL, NULL),
(84, 1, 15, 'test', NULL, NULL, NULL),
(85, 15, 1, 't', NULL, NULL, NULL),
(86, 1, 15, 'test', NULL, NULL, NULL),
(87, 15, 1, 'asdf', NULL, NULL, NULL),
(88, 1, 15, 'test', NULL, '2020-12-16 18:43:35', NULL),
(89, 1, 15, 'test2', NULL, '2020-12-25 18:43:50', NULL),
(90, 15, 1, 'test3', NULL, '2020-12-30 18:44:07', NULL),
(91, 1, 15, 'test4', NULL, '2020-12-25 18:44:53', NULL),
(92, 1, 3, 'test', NULL, NULL, NULL),
(93, 1, 11, 'test', NULL, NULL, NULL),
(94, 1, 11, 'test', NULL, NULL, NULL),
(95, 11, 1, 'test', NULL, NULL, NULL),
(96, 1, 11, 't asdf a', NULL, NULL, NULL),
(97, 1, 11, 'test', NULL, NULL, NULL),
(98, 1, 11, 'фыва', NULL, '2020-12-24 18:58:15', NULL),
(99, 11, 1, 'test', NULL, NULL, NULL),
(100, 11, 1, 'test 2', NULL, '2020-12-18 19:00:30', NULL),
(101, 1, 11, 'test3', NULL, '2020-12-19 19:00:44', NULL),
(102, 1, 11, 'test3', NULL, '2020-12-19 19:00:44', NULL),
(103, 11, 1, 'test4', NULL, NULL, NULL),
(104, 1, 11, 'test5', NULL, NULL, NULL),
(105, 1, 11, 'test', NULL, '2020-12-16 19:03:38', NULL),
(106, 1, 11, 'test', NULL, '2020-12-16 19:03:38', NULL),
(107, 1, 11, 'test', NULL, NULL, NULL),
(108, 1, 11, 'test', NULL, NULL, NULL),
(109, 1, 11, 'test', NULL, NULL, NULL),
(110, 1, 11, 'test', NULL, NULL, NULL),
(111, 1, 11, 'test', NULL, '2020-12-24 19:13:48', NULL),
(112, 11, 1, 'dfs sdfg ', NULL, '2020-12-16 19:16:58', NULL),
(113, 1, 11, 'tes', NULL, NULL, NULL),
(114, 1, 11, 'test', NULL, NULL, NULL),
(115, 11, 1, 'tessdft', NULL, NULL, NULL),
(116, 1, 11, 'asdf', NULL, NULL, NULL),
(117, 1, 11, 'asdf', NULL, NULL, NULL),
(118, 1, 11, 'asfd', NULL, NULL, NULL),
(119, 11, 1, 'jh', NULL, NULL, NULL),
(120, 11, 1, 'jh', NULL, NULL, NULL),
(121, 1, 11, 'test', NULL, NULL, NULL),
(122, 11, 1, 'test2', NULL, '2020-12-23 19:38:24', NULL),
(123, 1, 11, 'test3', NULL, '2020-12-26 19:39:55', NULL),
(124, 11, 1, 'test5', NULL, NULL, NULL),
(125, 11, 1, 'test55', NULL, NULL, NULL),
(126, 11, 1, 'test55', NULL, NULL, NULL),
(127, 11, 1, 'test99', NULL, NULL, NULL),
(128, 1, 11, 'test22', NULL, NULL, NULL),
(129, 1, 11, 'asdf', NULL, NULL, NULL),
(130, 1, 11, 'jhgj', NULL, NULL, NULL),
(131, 1, 11, 'test', NULL, NULL, NULL),
(132, 1, 11, 'asd sadf', NULL, NULL, NULL),
(133, 1, 11, 'test', NULL, '2020-12-23 20:18:42', NULL),
(134, 1, 11, 'tes ', NULL, '2020-12-25 20:21:16', NULL),
(135, 1, 11, 'test2', NULL, NULL, NULL),
(136, 11, 1, 'tess3', NULL, NULL, NULL),
(137, 1, 11, 'test13', NULL, NULL, NULL),
(138, 1, 11, 'test16', NULL, NULL, NULL),
(139, 1, 11, 'test17', NULL, NULL, NULL),
(140, 11, 1, 'test18', NULL, '2020-12-08 22:12:32', NULL),
(141, 11, 1, 'test18', NULL, '2020-12-14 22:14:48', NULL),
(142, 1, 11, 'test19', NULL, NULL, NULL),
(143, 1, 11, 'test', NULL, '2020-12-12 15:18:35', NULL),
(144, 11, 1, 'test', NULL, '2020-12-16 15:18:57', NULL),
(145, 11, 1, 'tes test test2', NULL, '2020-12-18 15:19:32', NULL),
(146, 1, 11, 'test test ', NULL, NULL, NULL),
(147, 1, 11, 'test', NULL, NULL, NULL),
(148, 1, 11, 'тест', NULL, '2020-12-24 15:23:00', NULL),
(149, 11, 1, 'еуые', NULL, NULL, NULL),
(150, 1, 11, 'еуые', NULL, '2020-12-25 15:27:51', NULL),
(151, 11, 1, 'tes as', NULL, NULL, NULL),
(152, 11, 1, 't', NULL, NULL, NULL),
(153, 1, 11, 'test', NULL, NULL, NULL),
(154, 11, 1, 'test2', NULL, NULL, NULL),
(155, 1, 11, 'test3', NULL, NULL, NULL),
(156, 1, 11, 'test4', NULL, NULL, NULL),
(157, 1, 11, 'test5', NULL, NULL, NULL),
(158, 1, 11, 'test6', NULL, NULL, NULL),
(159, 1, 11, 'test7', NULL, NULL, NULL),
(160, 11, 1, 'еуые', NULL, NULL, NULL),
(161, 11, 1, 'test', NULL, NULL, NULL),
(162, 11, 1, 'test13', NULL, NULL, NULL),
(163, 1, 11, 'test14', NULL, NULL, NULL),
(164, 1, 11, 'test15', NULL, NULL, NULL),
(165, 11, 1, 'test16', NULL, NULL, NULL),
(166, 1, 11, 'test17', NULL, NULL, NULL),
(167, 1, 11, 'test18', NULL, NULL, NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2014_10_12_000000_create_users_table', 1),
(2, '2014_10_12_100000_create_password_resets_table', 1),
(3, '2015_10_10_000000_create_menus_table', 1),
(4, '2015_10_10_000000_create_roles_table', 1),
(5, '2015_10_10_000000_update_users_table', 1),
(6, '2015_12_11_000000_create_users_logs_table', 1),
(7, '2016_03_14_000000_update_menus_table', 1),
(8, '2018_03_27_071648_create_capitals_table', 1),
(9, '2019_08_19_000000_create_failed_jobs_table', 2),
(10, '2020_10_21_102731_create_countries_table', 2),
(12, '2020_10_21_201809_create_news_statuses_table', 3),
(13, '2020_10_21_211904_create_google_news_table', 4),
(14, '2020_11_08_090350_create_links_table', 5),
(15, '2020_12_09_184747_create_messages_table', 6);

-- --------------------------------------------------------

--
-- Структура таблицы `news_statuses`
--

CREATE TABLE `news_statuses` (
  `id` int(10) UNSIGNED NOT NULL,
  `url` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `alpha3` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `putdate` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `password_resets`
--

CREATE TABLE `password_resets` (
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `roles`
--

CREATE TABLE `roles` (
  `id` int(10) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(10) UNSIGNED NOT NULL,
  `role_id` int(11) DEFAULT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `role_id`, `name`, `email`, `password`, `remember_token`, `created_at`, `updated_at`) VALUES
(1, NULL, 'Михалькевич Александр Викторович', 'mikhalkevich@ya.ru', '$2y$10$5npS1LLylXFKw3CT.A/kAuY3X5LtMdh7UGqlWO64J4L85rlYeLd3C', '5OECrlHKEaEmqmBFL1qZSz52TXFodb08tVYRnLDCQ4Ym32arou8TUjA4u3mE', '2020-11-08 08:33:53', '2020-11-08 08:33:53');

-- --------------------------------------------------------

--
-- Структура таблицы `users_logs`
--

CREATE TABLE `users_logs` (
  `id` int(10) UNSIGNED NOT NULL,
  `user_id` int(11) NOT NULL,
  `action` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `action_model` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `action_id` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `users_logs`
--

INSERT INTO `users_logs` (`id`, `user_id`, `action`, `action_model`, `action_id`, `created_at`, `updated_at`) VALUES
(1, 1, 'updated', 'users', 1, '2020-12-07 17:32:56', '2020-12-07 17:32:56');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `capitals`
--
ALTER TABLE `capitals`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `countries`
--
ALTER TABLE `countries`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Индексы таблицы `google_news`
--
ALTER TABLE `google_news`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `links`
--
ALTER TABLE `links`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `menus`
--
ALTER TABLE `menus`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `menus_name_unique` (`name`);

--
-- Индексы таблицы `menu_role`
--
ALTER TABLE `menu_role`
  ADD UNIQUE KEY `menu_role_menu_id_role_id_unique` (`menu_id`,`role_id`),
  ADD KEY `menu_role_menu_id_index` (`menu_id`),
  ADD KEY `menu_role_role_id_index` (`role_id`);

--
-- Индексы таблицы `messages`
--
ALTER TABLE `messages`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `news_statuses`
--
ALTER TABLE `news_statuses`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `password_resets`
--
ALTER TABLE `password_resets`
  ADD KEY `password_resets_email_index` (`email`);

--
-- Индексы таблицы `roles`
--
ALTER TABLE `roles`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- Индексы таблицы `users_logs`
--
ALTER TABLE `users_logs`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `capitals`
--
ALTER TABLE `capitals`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `countries`
--
ALTER TABLE `countries`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=252;

--
-- AUTO_INCREMENT для таблицы `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `google_news`
--
ALTER TABLE `google_news`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=46;

--
-- AUTO_INCREMENT для таблицы `links`
--
ALTER TABLE `links`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `menus`
--
ALTER TABLE `menus`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `messages`
--
ALTER TABLE `messages`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=168;

--
-- AUTO_INCREMENT для таблицы `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- AUTO_INCREMENT для таблицы `news_statuses`
--
ALTER TABLE `news_statuses`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT для таблицы `roles`
--
ALTER TABLE `roles`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `users_logs`
--
ALTER TABLE `users_logs`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `menu_role`
--
ALTER TABLE `menu_role`
  ADD CONSTRAINT `menu_role_menu_id_foreign` FOREIGN KEY (`menu_id`) REFERENCES `menus` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `menu_role_role_id_foreign` FOREIGN KEY (`role_id`) REFERENCES `roles` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
